MikroElektronika/core_packages/PIC/XC8/def/PIC16F914/mcu.h
extern volatile LCDDATA8bits_t LCDDATA8bits __at(0x118);
// bitfield macros
#define _LCDDATA8_SEG16_POSN                                0x0
#define _LCDDATA8_SEG16_POSITION                            0x0
#define _LCDDATA8_SEG16_SIZE                                0x1
#define _LCDDATA8_SEG16_LENGTH                              0x1
#define _LCDDATA8_SEG16_MASK                                0x1
#define _LCDDATA8_SEG17_POSN                                0x1
#define _LCDDATA8_SEG17_POSITION                            0x1
#define _LCDDATA8_SEG17_SIZE                                0x1
#define _LCDDATA8_SEG17_LENGTH                              0x1
#define _LCDDATA8_SEG17_MASK                                0x2
#define _LCDDATA8_SEG18_POSN                                0x2
#define _LCDDATA8_SEG18_POSITION                            0x2
#define _LCDDATA8_SEG18_SIZE                                0x1
#define _LCDDATA8_SEG18_LENGTH                              0x1
#define _LCDDATA8_SEG18_MASK                                0x4
#define _LCDDATA8_SEG19_POSN                                0x3
#define _LCDDATA8_SEG19_POSITION                            0x3
#define _LCDDATA8_SEG19_SIZE                                0x1
#define _LCDDATA8_SEG19_LENGTH                              0x1
#define _LCDDATA8_SEG19_MASK                                0x8
#define _LCDDATA8_SEG20_POSN                                0x4
#define _LCDDATA8_SEG20_POSITION                            0x4
#define _LCDDATA8_SEG20_SIZE                                0x1
#define _LCDDATA8_SEG20_LENGTH                              0x1
#define _LCDDATA8_SEG20_MASK                                0x10
#define _LCDDATA8_SEG21_POSN                                0x5
#define _LCDDATA8_SEG21_POSITION                            0x5
#define _LCDDATA8_SEG21_SIZE                                0x1
#define _LCDDATA8_SEG21_LENGTH                              0x1
#define _LCDDATA8_SEG21_MASK                                0x20
#define _LCDDATA8_SEG22_POSN                                0x6
#define _LCDDATA8_SEG22_POSITION                            0x6
#define _LCDDATA8_SEG22_SIZE                                0x1
#define _LCDDATA8_SEG22_LENGTH                              0x1
#define _LCDDATA8_SEG22_MASK                                0x40
#define _LCDDATA8_SEG23_POSN                                0x7
#define _LCDDATA8_SEG23_POSITION                            0x7
#define _LCDDATA8_SEG23_SIZE                                0x1
#define _LCDDATA8_SEG23_LENGTH                              0x1
#define _LCDDATA8_SEG23_MASK                                0x80
#define _LCDDATA8_SEG16COM2_POSN                            0x0
#define _LCDDATA8_SEG16COM2_POSITION                        0x0
#define _LCDDATA8_SEG16COM2_SIZE                            0x1
#define _LCDDATA8_SEG16COM2_LENGTH                          0x1
#define _LCDDATA8_SEG16COM2_MASK                            0x1
#define _LCDDATA8_SEG17COM2_POSN                            0x1
#define _LCDDATA8_SEG17COM2_POSITION                        0x1
#define _LCDDATA8_SEG17COM2_SIZE                            0x1
#define _LCDDATA8_SEG17COM2_LENGTH                          0x1
#define _LCDDATA8_SEG17COM2_MASK                            0x2
#define _LCDDATA8_SEG18COM2_POSN                            0x2
#define _LCDDATA8_SEG18COM2_POSITION                        0x2
#define _LCDDATA8_SEG18COM2_SIZE                            0x1
#define _LCDDATA8_SEG18COM2_LENGTH                          0x1
#define _LCDDATA8_SEG18COM2_MASK                            0x4
#define _LCDDATA8_SEG19COM2_POSN                            0x3
#define _LCDDATA8_SEG19COM2_POSITION                        0x3
#define _LCDDATA8_SEG19COM2_SIZE                            0x1
#define _LCDDATA8_SEG19COM2_LENGTH                          0x1
#define _LCDDATA8_SEG19COM2_MASK                            0x8
#define _LCDDATA8_SEG20COM2_POSN                            0x4
#define _LCDDATA8_SEG20COM2_POSITION                        0x4
#define _LCDDATA8_SEG20COM2_SIZE                            0x1
#define _LCDDATA8_SEG20COM2_LENGTH                          0x1
#define _LCDDATA8_SEG20COM2_MASK                            0x10
#define _LCDDATA8_SEG21COM2_POSN                            0x5
#define _LCDDATA8_SEG21COM2_POSITION                        0x5
#define _LCDDATA8_SEG21COM2_SIZE                            0x1
#define _LCDDATA8_SEG21COM2_LENGTH                          0x1
#define _LCDDATA8_SEG21COM2_MASK                            0x20
#define _LCDDATA8_SEG22COM2_POSN                            0x6
#define _LCDDATA8_SEG22COM2_POSITION                        0x6
#define _LCDDATA8_SEG22COM2_SIZE                            0x1
#define _LCDDATA8_SEG22COM2_LENGTH                          0x1
#define _LCDDATA8_SEG22COM2_MASK                            0x40
#define _LCDDATA8_SEG23COM2_POSN                            0x7
#define _LCDDATA8_SEG23COM2_POSITION                        0x7
#define _LCDDATA8_SEG23COM2_SIZE                            0x1
#define _LCDDATA8_SEG23COM2_LENGTH                          0x1
#define _LCDDATA8_SEG23COM2_MASK                            0x80
#define _LCDDATA8_S16C2_POSN                                0x0
#define _LCDDATA8_S16C2_POSITION                            0x0
#define _LCDDATA8_S16C2_SIZE                                0x1
#define _LCDDATA8_S16C2_LENGTH                              0x1
#define _LCDDATA8_S16C2_MASK                                0x1
#define _LCDDATA8_S17C2_POSN                                0x1
#define _LCDDATA8_S17C2_POSITION                            0x1
#define _LCDDATA8_S17C2_SIZE                                0x1
#define _LCDDATA8_S17C2_LENGTH                              0x1
#define _LCDDATA8_S17C2_MASK                                0x2
#define _LCDDATA8_S18C2_POSN                                0x2
#define _LCDDATA8_S18C2_POSITION                            0x2
#define _LCDDATA8_S18C2_SIZE                                0x1
#define _LCDDATA8_S18C2_LENGTH                              0x1
#define _LCDDATA8_S18C2_MASK                                0x4
#define _LCDDATA8_S19C2_POSN                                0x3
#define _LCDDATA8_S19C2_POSITION                            0x3
#define _LCDDATA8_S19C2_SIZE                                0x1
#define _LCDDATA8_S19C2_LENGTH                              0x1
#define _LCDDATA8_S19C2_MASK                                0x8
#define _LCDDATA8_S20C2_POSN                                0x4
#define _LCDDATA8_S20C2_POSITION                            0x4
#define _LCDDATA8_S20C2_SIZE                                0x1
#define _LCDDATA8_S20C2_LENGTH                              0x1
#define _LCDDATA8_S20C2_MASK                                0x10
#define _LCDDATA8_S21C2_POSN                                0x5
#define _LCDDATA8_S21C2_POSITION                            0x5
#define _LCDDATA8_S21C2_SIZE                                0x1
#define _LCDDATA8_S21C2_LENGTH                              0x1
#define _LCDDATA8_S21C2_MASK                                0x20
#define _LCDDATA8_S22C2_POSN                                0x6
#define _LCDDATA8_S22C2_POSITION                            0x6
#define _LCDDATA8_S22C2_SIZE                                0x1
#define _LCDDATA8_S22C2_LENGTH                              0x1
#define _LCDDATA8_S22C2_MASK                                0x40
#define _LCDDATA8_S23C2_POSN                                0x7
#define _LCDDATA8_S23C2_POSITION                            0x7
#define _LCDDATA8_S23C2_SIZE                                0x1
#define _LCDDATA8_S23C2_LENGTH                              0x1
#define _LCDDATA8_S23C2_MASK                                0x80

// Register: LCDDATA9
#define LCDDATA9 LCDDATA9
extern volatile unsigned char           LCDDATA9            __at(0x119);
#ifndef _LIB_BUILD
asm("LCDDATA9 equ 0119h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG0                   :1;
        unsigned SEG1                   :1;
        unsigned SEG2                   :1;
        unsigned SEG3                   :1;
        unsigned SEG4                   :1;
        unsigned SEG5                   :1;
        unsigned SEG6                   :1;
        unsigned SEG7                   :1;
    };
    struct {
        unsigned SEG0COM3               :1;
        unsigned SEG1COM3               :1;
        unsigned SEG2COM3               :1;
        unsigned SEG3COM3               :1;
        unsigned SEG4COM3               :1;
        unsigned SEG5COM3               :1;
        unsigned SEG6COM3               :1;
        unsigned SEG7COM3               :1;
    };
    struct {
        unsigned S0C3                   :1;
        unsigned S1C3                   :1;
        unsigned S2C3                   :1;
        unsigned S3C3                   :1;
        unsigned S4C3                   :1;
        unsigned S5C3                   :1;
        unsigned S6C3                   :1;
        unsigned S7C3                   :1;
    };
} LCDDATA9bits_t;
extern volatile LCDDATA9bits_t LCDDATA9bits __at(0x119);
// bitfield macros
#define _LCDDATA9_SEG0_POSN                                 0x0
#define _LCDDATA9_SEG0_POSITION                             0x0
#define _LCDDATA9_SEG0_SIZE                                 0x1
#define _LCDDATA9_SEG0_LENGTH                               0x1
#define _LCDDATA9_SEG0_MASK                                 0x1
#define _LCDDATA9_SEG1_POSN                                 0x1
#define _LCDDATA9_SEG1_POSITION                             0x1
#define _LCDDATA9_SEG1_SIZE                                 0x1
#define _LCDDATA9_SEG1_LENGTH                               0x1
#define _LCDDATA9_SEG1_MASK                                 0x2
#define _LCDDATA9_SEG2_POSN                                 0x2
#define _LCDDATA9_SEG2_POSITION                             0x2
#define _LCDDATA9_SEG2_SIZE                                 0x1
#define _LCDDATA9_SEG2_LENGTH                               0x1
#define _LCDDATA9_SEG2_MASK                                 0x4
#define _LCDDATA9_SEG3_POSN                                 0x3
#define _LCDDATA9_SEG3_POSITION                             0x3
#define _LCDDATA9_SEG3_SIZE                                 0x1
#define _LCDDATA9_SEG3_LENGTH                               0x1
#define _LCDDATA9_SEG3_MASK                                 0x8
#define _LCDDATA9_SEG4_POSN                                 0x4
#define _LCDDATA9_SEG4_POSITION                             0x4
#define _LCDDATA9_SEG4_SIZE                                 0x1
#define _LCDDATA9_SEG4_LENGTH                               0x1
#define _LCDDATA9_SEG4_MASK                                 0x10
#define _LCDDATA9_SEG5_POSN                                 0x5
#define _LCDDATA9_SEG5_POSITION                             0x5
#define _LCDDATA9_SEG5_SIZE                                 0x1
#define _LCDDATA9_SEG5_LENGTH                               0x1
#define _LCDDATA9_SEG5_MASK                                 0x20
#define _LCDDATA9_SEG6_POSN                                 0x6
#define _LCDDATA9_SEG6_POSITION                             0x6
#define _LCDDATA9_SEG6_SIZE                                 0x1
#define _LCDDATA9_SEG6_LENGTH                               0x1
#define _LCDDATA9_SEG6_MASK                                 0x40
#define _LCDDATA9_SEG7_POSN                                 0x7
#define _LCDDATA9_SEG7_POSITION                             0x7
#define _LCDDATA9_SEG7_SIZE                                 0x1
#define _LCDDATA9_SEG7_LENGTH                               0x1
#define _LCDDATA9_SEG7_MASK                                 0x80
#define _LCDDATA9_SEG0COM3_POSN                             0x0
#define _LCDDATA9_SEG0COM3_POSITION                         0x0
#define _LCDDATA9_SEG0COM3_SIZE                             0x1
#define _LCDDATA9_SEG0COM3_LENGTH                           0x1
#define _LCDDATA9_SEG0COM3_MASK                             0x1
#define _LCDDATA9_SEG1COM3_POSN                             0x1
#define _LCDDATA9_SEG1COM3_POSITION                         0x1
#define _LCDDATA9_SEG1COM3_SIZE                             0x1
#define _LCDDATA9_SEG1COM3_LENGTH                           0x1
#define _LCDDATA9_SEG1COM3_MASK                             0x2
#define _LCDDATA9_SEG2COM3_POSN                             0x2
#define _LCDDATA9_SEG2COM3_POSITION                         0x2
#define _LCDDATA9_SEG2COM3_SIZE                             0x1
#define _LCDDATA9_SEG2COM3_LENGTH                           0x1
#define _LCDDATA9_SEG2COM3_MASK                             0x4
#define _LCDDATA9_SEG3COM3_POSN                             0x3
#define _LCDDATA9_SEG3COM3_POSITION                         0x3
#define _LCDDATA9_SEG3COM3_SIZE                             0x1
#define _LCDDATA9_SEG3COM3_LENGTH                           0x1
#define _LCDDATA9_SEG3COM3_MASK                             0x8
#define _LCDDATA9_SEG4COM3_POSN                             0x4
#define _LCDDATA9_SEG4COM3_POSITION                         0x4
#define _LCDDATA9_SEG4COM3_SIZE                             0x1
#define _LCDDATA9_SEG4COM3_LENGTH                           0x1
#define _LCDDATA9_SEG4COM3_MASK                             0x10
#define _LCDDATA9_SEG5COM3_POSN                             0x5
#define _LCDDATA9_SEG5COM3_POSITION                         0x5
#define _LCDDATA9_SEG5COM3_SIZE                             0x1
#define _LCDDATA9_SEG5COM3_LENGTH                           0x1
#define _LCDDATA9_SEG5COM3_MASK                             0x20
#define _LCDDATA9_SEG6COM3_POSN                             0x6
#define _LCDDATA9_SEG6COM3_POSITION                         0x6
#define _LCDDATA9_SEG6COM3_SIZE                             0x1
#define _LCDDATA9_SEG6COM3_LENGTH                           0x1
#define _LCDDATA9_SEG6COM3_MASK                             0x40
#define _LCDDATA9_SEG7COM3_POSN                             0x7
#define _LCDDATA9_SEG7COM3_POSITION                         0x7
#define _LCDDATA9_SEG7COM3_SIZE                             0x1
#define _LCDDATA9_SEG7COM3_LENGTH                           0x1
#define _LCDDATA9_SEG7COM3_MASK                             0x80
#define _LCDDATA9_S0C3_POSN                                 0x0
#define _LCDDATA9_S0C3_POSITION                             0x0
#define _LCDDATA9_S0C3_SIZE                                 0x1
#define _LCDDATA9_S0C3_LENGTH                               0x1
#define _LCDDATA9_S0C3_MASK                                 0x1
#define _LCDDATA9_S1C3_POSN                                 0x1
#define _LCDDATA9_S1C3_POSITION                             0x1
#define _LCDDATA9_S1C3_SIZE                                 0x1
#define _LCDDATA9_S1C3_LENGTH                               0x1
#define _LCDDATA9_S1C3_MASK                                 0x2
#define _LCDDATA9_S2C3_POSN                                 0x2
#define _LCDDATA9_S2C3_POSITION                             0x2
#define _LCDDATA9_S2C3_SIZE                                 0x1
#define _LCDDATA9_S2C3_LENGTH                               0x1
#define _LCDDATA9_S2C3_MASK                                 0x4
#define _LCDDATA9_S3C3_POSN                                 0x3
#define _LCDDATA9_S3C3_POSITION                             0x3
#define _LCDDATA9_S3C3_SIZE                                 0x1
#define _LCDDATA9_S3C3_LENGTH                               0x1
#define _LCDDATA9_S3C3_MASK                                 0x8
#define _LCDDATA9_S4C3_POSN                                 0x4
#define _LCDDATA9_S4C3_POSITION                             0x4
#define _LCDDATA9_S4C3_SIZE                                 0x1
#define _LCDDATA9_S4C3_LENGTH                               0x1
#define _LCDDATA9_S4C3_MASK                                 0x10
#define _LCDDATA9_S5C3_POSN                                 0x5
#define _LCDDATA9_S5C3_POSITION                             0x5
#define _LCDDATA9_S5C3_SIZE                                 0x1
#define _LCDDATA9_S5C3_LENGTH                               0x1
#define _LCDDATA9_S5C3_MASK                                 0x20
#define _LCDDATA9_S6C3_POSN                                 0x6
#define _LCDDATA9_S6C3_POSITION                             0x6
#define _LCDDATA9_S6C3_SIZE                                 0x1
#define _LCDDATA9_S6C3_LENGTH                               0x1
#define _LCDDATA9_S6C3_MASK                                 0x40
#define _LCDDATA9_S7C3_POSN                                 0x7
#define _LCDDATA9_S7C3_POSITION                             0x7
#define _LCDDATA9_S7C3_SIZE                                 0x1
#define _LCDDATA9_S7C3_LENGTH                               0x1
#define _LCDDATA9_S7C3_MASK                                 0x80

// Register: LCDDATA10
#define LCDDATA10 LCDDATA10
extern volatile unsigned char           LCDDATA10           __at(0x11A);
#ifndef _LIB_BUILD
asm("LCDDATA10 equ 011Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG8                   :1;
        unsigned SEG9                   :1;
        unsigned SEG10                  :1;
        unsigned SEG11                  :1;
        unsigned SEG12                  :1;
        unsigned SEG13                  :1;
        unsigned SEG14                  :1;
        unsigned SEG15                  :1;
    };
    struct {
        unsigned SEG8COM3               :1;
        unsigned SEG9COM3               :1;
        unsigned SEG10COM3              :1;
        unsigned SEG11COM3              :1;
        unsigned SEG12COM3              :1;
        unsigned SEG13COM3              :1;
        unsigned SEG14COM3              :1;
        unsigned SEG15COM3              :1;
    };
    struct {
        unsigned S8C3                   :1;
        unsigned S9C3                   :1;
        unsigned S10C3                  :1;
        unsigned S11C3                  :1;
        unsigned S12C3                  :1;
        unsigned S13C3                  :1;
        unsigned S14C3                  :1;
        unsigned S15C3                  :1;
    };
} LCDDATA10bits_t;
